# PanelTypes Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..PanelTypes Property
Document Class See Also
---
Retrieves a set of PanelType objects that contains all the panel types that are currently loaded into the project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PanelTypeSet PanelTypes { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PanelTypes As PanelTypeSet
	Get
```

Visual C++
---
```text
public:
property PanelTypeSet^ PanelTypes {
	PanelTypeSet^ get ();
}
```

# Remarks
This property returns a set of panelType objects. These objects can be used change the type of a panel from one type to another.
# See Also
Document Class
Autodesk.Revit.DB Namespace